<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of kolide launcher and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.weswhet.munki.launcher</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>launcher</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.weswhet.pkg.launcher</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>catalogs</key>
					<array>
						<string>Production</string>
					</array>
					<key>category</key>
					<string>Utilities</string>
					<key>description</key>
					<string>Osquery launcher, autoupdater, and packager.
Release Notes:
%release_notes%</string>
					<key>developer</key>
					<string>Kolide</string>
					<key>display_name</key>
					<string>launcher</string>
					<key>name</key>
					<string>%NAME%</string>
					<key>unattended_install</key>
					<true/>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
 		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-pkg</string>
				<key>installs_item_paths</key>
				<array>
					<string>/usr/local/launcher/bin/launcher</string>
					<string>/usr/local/launcher/bin/osquery-extension.ext</string>
					<string>/usr/local/launcher/bin/osqueryd</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
